applications/test/regionUncollatedFileOperation/cavity_region/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

myRegion
{
    ddtSchemes
    {
        default         Euler;
    }

    gradSchemes
    {
        default         Gauss linear;
        grad(p)         Gauss linear;
    }

    divSchemes
    {
        default         none;
        div(phi,U)      Gauss linear;
    }

    laplacianSchemes
    {
        default         Gauss linear orthogonal;
    }

    interpolationSchemes
    {
        default         linear;
    }

    snGradSchemes
    {
        default         orthogonal;
    }
}

// ************************************************************************* //
